function setup() {
  createCanvas(600, 400);
}



function draw() {
  background(0);

  // 별들 표현
  fill(255);
  circle(50, 60, 3);

  fill(255, 255, 0);
  circle(120, 150, 6);

  fill(255, 0, 255);
  circle(300, 80, 4);

  fill(255);
  circle(360, 200, 2);

  fill(255);
  circle(200, 300, 3);

  fill(255);
  circle(100, 300, 5);

  fill(135, 206, 250);
  circle(500, 50, 3);

  fill(255, 165, 0);
  circle(550, 100, 5);

  fill(173, 216, 230);
  circle(450, 150, 4);

  fill(255, 20, 147);
  circle(520, 200, 3);

  fill(255, 255, 255);
  circle(580, 250, 2);

  fill(0, 191, 255);
  circle(400, 300, 4);

  fill(255, 255, 255);
  circle(350, 370, 3);

  fill(221, 160, 221);
  circle(250, 350, 4);

  fill(255, 255, 255);
  circle(80, 200, 2);

  fill(255, 192, 203);
  circle(60, 300, 3);

  fill(255, 255, 224);
  circle(150, 80, 4);

  fill(176, 224, 230);
  circle(180, 50, 3);

  fill(240, 248, 255);
  circle(280, 180, 2);

  fill(255, 99, 71);
  circle(320, 250, 5);

  fill(0, 255, 255);
  circle(420, 90, 3);

  fill(255, 255, 255);
  circle(500, 280, 4);
  
  // =========================================== //


  // 몸통
  fill(230);
  rect(170, 200, 60, 80, 10);

  fill(180);
  rect(185, 230, 30, 20, 3);
  fill(255, 80, 80);
  circle(192, 240, 5);
  fill(80, 255, 120);
  circle(200, 240, 5);
  fill(80, 140, 255);
  circle(208, 240, 5);

  // 배낭
  fill(200);
  rect(160, 210, 15, 60, 5); // 옆에 붙은 배낭

  // 머리
  fill(240);
  ellipse(200, 170, 70, 70); // 헬멧 외곽
  fill(40, 60, 90);
  ellipse(200, 170, 50, 50); // 안쪽 유리창
  fill(220);
  arc(190, 160, 20, 10, PI + QUARTER_PI, TWO_PI); // 반짝임

  // 팔
  stroke(230);
  strokeWeight(10);
  line(170, 220, 140, 200); // 왼팔
  line(230, 220, 260, 240); // 오른팔
  noStroke();
  fill(230);
  circle(140, 200, 15); // 왼손
  circle(260, 240, 15); // 오른손

  // 다리
  stroke(230);
  strokeWeight(12);
  line(185, 280, 175, 320); // 왼쪽 다리
  line(215, 280, 225, 320); // 오른쪽 다리
  noStroke();
  fill(210);
  rect(165, 320, 20, 10, 2); // 왼쪽 신발
  rect(215, 320, 20, 10, 2); // 오른쪽 신발
  
  // 우주선
  fill(210);
  triangle(300,100, 350, 100, 350, 50); // 우주선 몸통
  rect(350,50,100,50);
  fill(0);
  triangle(300,100,310,100,310,90);
  
  stroke(0,0,0);
  strokeWeight(3);
  line(380,60,390,60);
  line(380,60,380,70);
  line(380,70,390,70);
  line(390,70,390,80);
  line(380,80,390,80);
  
  line(400,60,410,60);
  line(400,60,400,70);
  line(400,70,410,70);
  line(410,70,410,80);
  line(400,80,410,80);
  
  line(420,60,420,80);
  line(420,80,430,80);
  line(430,80,430,60);
  
  noStroke();
  fill(135, 206, 250);
  triangle(325,75,350,75,350,50); // 창문
  rect(350,50,20,25);
  
  fill(230);
  rect(450,75,15,15); // 엔진
  fill(255,0,0);
  triangle(465,75,465,90,490,83.5); // 불
  
  
  // 행성
  fill(200, 160, 100);
  noStroke();
  ellipse(600, 400, 300, 300);

  // 크레이터
  fill(160, 120, 80);
  ellipse(530, 370, 40, 30);
  ellipse(580, 330, 25, 18);
  ellipse(550, 310, 30, 20);
  ellipse(500, 340, 20, 15);
}
